<script>
  import Vacancie from "$lib/components/vacancie/Vacancie.svelte";
  let testDataList = [
    {
      id: 1,
      name: "Уборка парка",
      description: "Необходимо убрать мусор в парке Горького после дня космонавтики.",
      date: "2022-03-29",
      location: "Москва Парк Горького",
      type: "Стажировка",
      tasks: "",
      participants: 2,
      participation_type: "ofline",
      company: {},
      image: "http://room-number.ru/wp-content/uploads/2017/10/park-gorkogo-22.jpg",
      skills: ["Свежий воздух", "Городские пространства"]
    },
    {
      id: 2,
      name: "Выгул детей",
      description: "Необходимо погулять с детьми из детдома \"Василек\".",
      date: "2022-06-14",
      location: "",
      type: "Стажировка",
      tasks: "",
      participants: 3,
      participation_type: "online",
      company: {},
      image: "https://n1s2.hsmedia.ru/c7/53/d1/c753d1e2641e5e797d17882eb664be66/728x484_1_cf1807640669d0e83db859cbe8b2b9bb@4816x3204_0xac120003_17907956671647506659.jpeg",
      skills: ["Дети", "Стойкая психика", "Забота о ближних"]
    },
    {
      id: 3,
      name: "Кормежка бродячих собак",
      description: "Необходимо покормить бродячих собак в районе Одинцово.",
      date: "2022-12-21",
      location: "Одинцово ул. Лесная д. 42",
      type: "Стажировка",
      tasks: `
      Участие в разработке стратегии привлечения средств от компаний
      Мониторинг рынка и поиск потенциальных партнеров, в т.ч. «холодный» поиск,
      формирование отношений с нуля, привлечение, формирование базы
      Подготовка предложения для потенциальных корпоративных партнеров
      Ведение переговоров с существующими и потенциальными компаниями-партнерами,
      подготовка и передача партнерам информационных материалов и документов,
      необходимых для оформления сотрудничества
      Ответственность за подписание и переподписание соглашений с партнерами
      Координация маркетинговых проектов c существующими компаниями-партнерами
      Участие в подготовке благотворительных и корпоративных мероприятий компаний-партнеров
      Совершенствование имеющихся инструментов привлечения корпоративной поддержки (спонсорские пакеты, благотворительные открытки и др.), разработка новых
      Координация работы подрядчиков (агентства, сторонние специалисты, волонтеры др.) в рамках проектов и акций, направленных на работу с корпоративными партнерами
      Мониторинг рынка на предмет появления новых трендов и технологий в привлечении корпоративных доноров, представление дайджеста руководству с описанием
      возможностей реализации в фонде.`,
      participants: 12,
      participation_type: "ofline",
      company: {name: "БФ Кораблик", description: "детский благотворительный фонд", rating: "5.0", grade: "1 место", img: "https://media-exp1.licdn.com/dms/image/C4D0BAQG6MLcBzJThug/company-logo_200_200/0/1519889862676?e=2147483647&v=beta&t=De-zc0-89y0BlNZSiD0S7adA43I35nsflrZSR4blNlU"},
      image: "https://www.ptichka.ru/data/cache/2017dec/06/12/40990_15810-600x0.jpg",
      skills: ["Собаки", "Забота о ближних", "Свежий воздух"]
    }
  ]
</script>

<div>
  {#each testDataList as data}
    <Vacancie {data}/>
  {/each}
</div>
